Chapters/Chapter_5/CASE1.1/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../myVars" //Include global variables

dynamicFvMesh dynamicMotionSolverFvMesh;
motionSolverLibs 
(
  "sixDoFRigidBodyMotion"
  "libfvMotionSolvers.so"
  "libnewSixDoFRigidBodyMotion.so"
);
solver sixDoFRigidBodyMotion;
diffusivity     quadratic inverseDistance ( floater );
 
sixDoFRigidBodyMotionCoeffs
{
  patches         ( floater );
  innerDistance   #calc "1.5*$BL_thick";
  outerDistance   #calc "$zmax - ($plat_comz)"; //distance to the closest boundary (top)
  centreOfMass    ($total_comx 0 $total_comz);
  mass            $total_mass;
  g               ( 0 0 -9.8065);
  momentOfInertia ($plat_Ixx $plat_Iyy $plat_Izz);
  velocity        ( 0    0   0 );
  //angularMomentum (0    0   0); //units [kg-m^2*deg/s]
  orientation     $plat_orientation;  //Rotation tensor (ZYX convention), see http://planning.cs.uiuc.edu/node102.html
  
  //rhoName         rhoInf; //For incompressible, in case density is uniform
  //rhoInf          1024.81;

  accelerationRelaxation 1.0;
  accelerationDamping 1.0;
  report          on;
  reportToFile    on;
  solver
  {
      type            Newmark;
  }

  constraints
  {
    pitchOnly
    {
      sixDoFRigidBodyMotionConstraint   axis;
      axis                              (0.0 1.0 0.0);
    }

    surgeOnly
    {
      sixDoFRigidBodyMotionConstraint   line;
      direction                         (1.0 0.0 0.0);
    }
  }

   restraints
   {
    
      turbineThrust
      {
        sixDoFRigidBodyMotionRestraint constantLoad;
        applicationPt   (-5.0 0.0 90.0); // Hub position
        movePt          true; // Move CoG with rigid body
        force           (5.906E+5 0.0 0.0); // Thrust (global frame)
        torque          (0.0 0.0 0.0); // None  
      }
    
    
moorDynR1
			{
				sixDoFRigidBodyMotionRestraint moorDynR1;
			}

    }
    
   
}

// ************************************************************************* //
